Revit 2027 API
BuiltInFailures.LinkFailures.ModifiedLinkedFile Property
 Shared Sites in the link have been modified, use move instance to reset the change.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ModifiedLinkedFile { get; }
Public Shared ReadOnly Property ModifiedLinkedFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ModifiedLinkedFile {
	FailureDefinitionId^ get ();
}
static member ModifiedLinkedFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace